harmony.common.security/target/classes/data/CreateReservation.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://10.1.3.201:8080/harmony-adapter-uclp/services/Reservation</wsa:To>
        <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://ist_phosphorus.eu/nsp/webservice/reservation/createReservation</wsa:Action>
        <wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">uuid:40159cee-10dc-397e-c14f-258beedc4758</wsa:MessageID>
        <wsa:From xmlns:wsa="http://www.w3.org/2005/08/addressing">
            <wsa:Address>http://www.w3.org/2005/08/addressing/role/anonymous</wsa:Address>
        </wsa:From>
    </soap:Header>
    <soap:Body>
        <pfx0:createReservation
            xmlns:pfx0="http://ist_phosphorus.eu/nsp/webservice/reservation" xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
            <pfx0:createReservation
                xmlns="http://ist_phosphorus.eu/nsp/webservice/topology"
                xmlns:ns2="http://ist_phosphorus.eu/nsp"
                xmlns:ns3="http://ist_phosphorus.eu/nsp/webservice/notification"
                xmlns:ns4="http://ist_phosphorus.eu/nsp/webservice/reservation"
                xmlns:ns5="http://www.w3.org/2005/08/addressing" xmlns:ns6="http://docs.oasis-open.org/wsrf/bf-2">
                <ns4:createReservation>
                    <ns4:Service>
                        <ns4:ServiceID>1</ns4:ServiceID>
                        <ns4:TypeOfReservation>fixed</ns4:TypeOfReservation>
                        <ns4:FixedReservationConstraints>
                            <ns4:StartTime>2009-06-05T07:40:03.000Z</ns4:StartTime>
                            <ns4:Duration>800</ns4:Duration>
                        </ns4:FixedReservationConstraints>
                        <ns4:AutomaticActivation>true</ns4:AutomaticActivation>
                        <ns4:Connections>
                            <ns4:ConnectionID>1</ns4:ConnectionID>
                            <ns4:Source>
                                <ns2:EndpointId>10.3.3.10</ns2:EndpointId>
                                <ns2:Name/>
                                <ns2:Description/>
                                <ns2:Interface>user</ns2:Interface>
                                <ns2:DomainId>i2cat-hna-adapter-1</ns2:DomainId>
                                <ns2:Bandwidth>0</ns2:Bandwidth>
                            </ns4:Source>
                             <ns4:Target>
                                <ns2:EndpointId>10.3.3.1</ns2:EndpointId>
                                <ns2:Name>FB1</ns2:Name>
                                <ns2:Description>AD1-FB1</ns2:Description>
                                <ns2:Interface>border</ns2:Interface>
                                <ns2:DomainId>i2cat-hna-adapter-1</ns2:DomainId>
                                <ns2:Bandwidth>1250</ns2:Bandwidth>
                            </ns4:Target>
                            <ns4:Directionality>1</ns4:Directionality>
                            <ns4:MinBW>800</ns4:MinBW>
                            <ns4:MaxBW>800</ns4:MaxBW>
                        </ns4:Connections>
                    </ns4:Service>
                    <ns4:GRI>B24220C96526969454C717BD10FE88048E95E873</ns4:GRI>
                    <ns4:Token>3477B1C05271F5B777C92F4120B905C44A31295D</ns4:Token>
                </ns4:createReservation>
            </pfx0:createReservation>
        </pfx0:createReservation>
    </soap:Body>
</soap:Envelope>
                            